<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"5bcbe73b96c980cf174a2a66d95704833c28d5143a15595e9d2ba689f424f1a5","plan_job_ref":"Job Validations on PR #26 at https://github.com/SelfOverflow/discord-bots/actions/runs/22518061574","plan_out_hash":"5527d1cd09d93a7471bcd055f9e3e1823fdb4ea65a7b433d097457d0b7b738b4","plan_hash":"0d184050d81af720063250efa72bda3b9302dc7472205df5a9e8b25a0305018c","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
<details>
<summary>Plan: 11 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_dynamodb_table.users will be created
+   resource "aws_dynamodb_table" "users" {
+       arn              = (known after apply)
+       billing_mode     = "PAY_PER_REQUEST"
+       hash_key         = "**"
+       id               = (known after apply)
+       name             = "bablu-bot-users"
+       range_key        = "**"
+       read_capacity    = (known after apply)
+       stream_arn       = (known after apply)
+       stream_label     = (known after apply)
+       stream_view_type = (known after apply)
+       tags             = {
+           "Name" = "bablu-bot-users-table"
        }
+       tags_all         = {
+           "Name" = "bablu-bot-users-table"
        }
+       write_capacity   = (known after apply)

+       attribute {
+           name = "pk"
+           type = "S"
        }
+       attribute {
+           name = "sk"
+           type = "S"
        }

+       point_in_time_recovery (known after apply)

+       server_side_encryption (known after apply)

+       ttl (known after apply)
    }

  # aws_ecr_repository.bablu-ecr will be created
+   resource "aws_ecr_repository" "bablu-ecr" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "bablu-container-repository"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags_all             = (known after apply)

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

  # aws_internet_gateway.igw will be created
+   resource "aws_internet_gateway" "igw" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "bablu-bot-igw"
        }
+       tags_all = {
+           "Name" = "bablu-bot-igw"
        }
+       vpc_id   = (known after apply)
    }

  # aws_route_table.public will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               cidr_block                 = "0.0.0.0/0"
+               gateway_id                 = (known after apply)
#                (11 unchanged attributes hidden)
            },
        ]
+       tags             = {
+           "Name" = "bablu-bot-public-rt"
        }
+       tags_all         = {
+           "Name" = "bablu-bot-public-rt"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.public_a will be created
+   resource "aws_route_table_association" "public_a" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_b will be created
+   resource "aws_route_table_association" "public_b" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_security_group.ecs_sg will be created
+   resource "aws_security_group" "ecs_sg" {
+       arn                    = (known after apply)
+       description            = "Outbound only HTTPS for Discord Gateway"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
#                (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "bablu-bot-ecs-sg"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "bablu-bot-ecs-sg"
        }
+       tags_all               = {
+           "Name" = "bablu-bot-ecs-sg"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_sqs_queue.events will be created
+   resource "aws_sqs_queue" "events" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 345600
+       name                              = "bablu-bot-events"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 0
+       redrive_allow_policy              = (known after apply)
+       redrive_policy                    = (known after apply)
+       sqs_managed_sse_enabled           = (known after apply)
+       tags_all                          = (known after apply)
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 60
    }

  # aws_subnet.public_a will be created
+   resource "aws_subnet" "public_a" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-south-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "bablu-bot-public-a"
        }
+       tags_all                                       = {
+           "Name" = "bablu-bot-public-a"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_b will be created
+   resource "aws_subnet" "public_b" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "ap-south-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.16.0/20"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "bablu-bot-public-b"
        }
+       tags_all                                       = {
+           "Name" = "bablu-bot-public-b"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "bablu-bot-vpc"
        }
+       tags_all                             = {
+           "Name" = "bablu-bot-vpc"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   dynamodb_table_name = "bablu-bot-users"
+   ecs_security_group  = (known after apply)
+   public_subnets      = [
+       (known after apply),
+       (known after apply),
    ]
+   sqs_queue_url       = (known after apply)
+   vpc_id              = (known after apply)
```
</details>

:x: Error applying plan in [Post merge deploy to production #15](https://github.com/SelfOverflow/discord-bots/actions/runs/22518087513)